###### 运算
 1. 小数运算问题  
    
      1. 0.1 * 0.1的问题:  
        &ensp;&ensp;&ensp;&ensp;这个结果看上去，不言而喻，应该是0.01，但实际上，屏幕输出却是0.010000001，后面多了个
        看上去这么简单的运算，计算机怎么会出错了呢 ？  
            &ensp;&ensp;&ensp;&ensp;实际上，不是运算本身会出错，而是计算机根本就不能精确的表示很多数，比如0.1这个数。
        计算机是用一种二进制格式存储小数的，这个二进制格式不能精确表示0.1，它只能表示一个非常接近0.1但又不等于0.1的一个数。
        数字都不能精确表示，在不精确数字上的运算结果不精确也就不足为奇了。
        
       2. 0.1怎么会不能精确表示呢？  
        &ensp;&ensp;&ensp;&ensp;在十进制的世界里是可以的，但在二进制的世界里不行很多数，十进制也是不能精确表示的，
        比如1/3, 保留三位小数的话，十进制表示是0.333，但无论后面保留多少位小数，都是不精确的，用0.333进行运算，比如乘以3，期望结果是1，但实际上却是0.999
        可以精确表示为2的某次方之和的数可以精确表示，其他数则不能精确表示
        
       3. 计算不精确，怎么办呢？  
        &ensp;&ensp;&ensp;&ensp;大部分情况下，我们不需要那么高的精度，可以四舍五入，或者在输出的时候只保留固定个数的小数位。
        如果真的需要比较高的精度，一种方法是将小数转化为整数进行运算，运算结束后再转化为小数，另外的方法一般是使用十进制的数据类型，这个没有统一的规范，在Java中是BigDecimal，运算更准确，但效率比较低
        
    
  2. 逻辑运算与位运算  
        1. 逻辑运算符：  
            &:逻辑与 -->同true才为true，只要有一个false，全都false 即有假则为假，全真则为真（有假必假，全真为真）  
            |:逻辑或  --> 只要有一个为true,就为true，同为false才为false 即有真则为真，全假则为假（有真必真，全假为假）  
            !: 逻辑非 --> 取反，若为true，则输出为false，若为false，则输出为true  
            &&: 短路与 -->与逻辑与类似，详情见下  
            ||: 短路或 --> 与逻辑或类似，详情见下 
   
        2. 逻辑与和短路与的区别  
            逻辑与的判断方式是：从左到右依次判断，直到结尾（逻辑全程运算）  
            短路与的判断方式是: 从左到右依次判断，直到出现false为止将不再判断，直接得到结果为false（短路遇false就停）  
         
         3. 逻辑或和短路或的区别  
                逻辑或的判断方式是：从左到右依次判断，直到结尾  
                短路或的判断方式是: 从左到右依次判断，直到出现true为止将不再判断，直接得到结果为true
        
  3. 位运算：  
        1.  左移：操作符为<<，向左移动，右边的低位补0，高位的就舍弃掉了，将二进制看做整数，左移1位就相当于乘以2。  
        
        2.  无符号右移：操作符为>>>，向右移动，右边的舍弃掉，左边补0，右移1位相当于处于2。
        
        3. 有符号右移：操作符为>>，向右移动，右边的舍弃掉，左边补什么取决于原来最高位是什么，原来是1就补1，原来是0就补0，将二进制看做整数，右移1位相当于除以2。   
        例：  
           int a = 4;  
           a  >> 2  //a右移2位，相当于 a = a/2/2,即a除以2的值再除以2  
           a << 3 //a左移3位，相当于a = a*2*2*2,即a乘以2的值在乘以2，得到的值再乘以2  
           a = 8    
           
  4. 逻辑位运算有  
        1. 按位与 &：两位都为1才为1  
        
        2. 按位或 |：只要有一位为1，就为1  
        
        3. 按位取反 ~： 1变为0，0变为1  
        
        4. 按位异或 ^ ：相异为真，相同为假  
        
        